//***********************************************************************************************************
//
// カメラ情報構築クラス
//
//***********************************************************************************************************
#pragma once

//***********************************************************************************************************
// インクルード部
//***********************************************************************************************************
#include "CDirectX.h"

//***********************************************************************************************************
// クラス定義
//***********************************************************************************************************
class CCamera
{
private:
	static D3DXMATRIX   mtxView;			// ビューマトリクス
	static D3DXMATRIX   mtxProjection;		// プロジェクションマトリクス

	static D3DXVECTOR3	posCameraP;			// 視点
	static D3DXVECTOR3	posCameraT;			// 注視点
	static D3DXVECTOR3	vecCameraU;			// 上

	static D3DXVECTOR3	rotCamera;

public:
	void Init(void);		// 初期化
	void Finalise(void);	// 終了
	void Update(void);		// 更新
	void Set();				// カメラセット

	// 変数引き渡し関数↓
	static D3DXMATRIX   GetMtxView() { return mtxView; };
	static D3DXVECTOR3	Get_posCamera() { return posCameraP; };
	D3DXMATRIX*	GetPView() { return &mtxView; };
	D3DXMATRIX* GetPPrj() { return &mtxProjection; };
};

//***********************************************************************************************************
// EOF
//***********************************************************************************************************