//***********************************************************************************************************
//
// 2D画像描画基本クラス
//
//***********************************************************************************************************
#pragma once

//***********************************************************************************************************
// インクルード部
//***********************************************************************************************************
#include "Define.h"
#include "CDirectX.h"		// DirectX情報
#include "CInput.h"			// キーボード、マウス情報
#include "CSound.h"			// サウンド情報

#include "Debug_DataSave.h"

//***********************************************************************************************************
// 構造体定義
//***********************************************************************************************************
typedef struct
{
	D3DXVECTOR3	Obj_Pos;	// 座標(画像の中心を原点)
	D3DXVECTOR2	Obj_Size;	// オブジェクトのサイズ(X,Y)
	D3DXVECTOR2	Tex_Pos;	// テクスチャ座標(0.0f～1.0f)
	D3DXVECTOR2	Tex_Anim;	// 1アニメーション毎のテクスチャ座標(1アニメーションなら1.0f)
	float		fScale;		// 画像の拡大率(0.0f～)
	float		fRot;		// 画像の回転角度(0.0f～)
	int			Red;		// 画像のR値
	int			Green;		// 画像のG値
	int			Brue;		// 画像のB値
	int			Alpha;		// 画像のアルファ値

}TEXTURE_2D_DATA;

//***********************************************************************************************************
// 列挙体定義
//***********************************************************************************************************

// テクスチャを合成する際の設定
typedef enum
{
	ADD,

}BLEND_MODE;

//***********************************************************************************************************
// クラス定義
//***********************************************************************************************************
class CTexture_2D_Base
{
	VERTEX_2D*			aVertex;				// 頂点情報格納

protected:
	LPDIRECT3DTEXTURE9*	pTexture;				// テクスチャデータへのポインタ
	TEXTURE_2D_DATA*	Tex_2D_Data;			// テクスチャ情報まとめ構造体
	int					nObject_Num;			// オブジェクトを何個生成するか？(基本は1を入れておいてください)
	int					nUse_Texture_Num;		// テクスチャは何個使用するか？(基本は1を入れておいてください)
	

private:
	void		MakeVertex();					// 頂点情報初期化
	void		SetVertex();					// 頂点座標更新
	void		SetTexture();					// テクスチャ座標情報更新
	void		SetColor();						// テクスチャカラー情報更新

protected:
	void Load_Texture(char* TEXTURE_FILE, int NUMBER);			// テクスチャ読み込み
	void Texture_Blend(int STAGE, int NUMBER, int TYPE);		// テクスチャブレンド

public:
	virtual void Init();										// 初期化
	virtual void Finalise();									// 終了
	virtual void Update();										// 更新
	virtual void Draw(int NUMBER, int SET_TEXTURE);				// 描画
	
	CTexture_2D_Base();											// コンストラクタ
	virtual ~CTexture_2D_Base();								// デストラクタ
};

//***********************************************************************************************************
// EOF
//***********************************************************************************************************