//*************************************************************************
//
// デバッグコマンドまとめ
//
//*************************************************************************

#include "Debug_DataSave.h"

//*************************************************************************
// オブジェクトの座標をファイルに書き込み(追加式)
//*************************************************************************
void Debug_Save_ObjectPos(char* Name, D3DXVECTOR3 pos)
{
	FILE* fp;


	fp = fopen("../ObjectPos.txt", "a");

	fprintf( fp, "オブジェクト名 : %s :: X座標 : %.2f :: Y座標 : %.2f :: Z座標 : %.2f\n",Name, pos.x, pos.y, pos.z);

	fclose(fp);

}