//*************************************************************************
//
// äeéÌï÷óòä÷êîèîÅX
//
//*************************************************************************
#pragma once

#include "CDirectX.h"

void LOAD_TEXTURE(LPDIRECT3DTEXTURE9& TEXTURE, char* TEXTURE_FILE);
void CREATE_TEXTURE(LPDIRECT3DTEXTURE9& TEXTURE, DWORD COLOR);

//*************************************************************************
// EOF
//*************************************************************************