//*************************************************************************
//
// ここにオブジェクトの説明
//
//*************************************************************************
#pragma once 

//*************************************************************************
// インクルード部
//*************************************************************************
#include "CTexture_2D_Base.h" 
#include <deque>

using namespace std;

//*************************************************************************
// クラス定義
//*************************************************************************
class GameMain_Bar : public CTexture_2D_Base
{
private:
	int	LaneSize;
	int	CursolSize;

	deque<int> SelectLane;
	float MouseY;
public:
	void Initialize(int laneSize, int cursolSize);
	void Update(void);
	void Draw(void);

	void AddRotate();

	GameMain_Bar(void);
	virtual ~GameMain_Bar(void);

	deque<int> GetSelectLane();	// 選択中のレーンを返す
};

//*************************************************************************
// EOF
//*************************************************************************
