#pragma once

//***********************************************************************************************************
// インクルード部
//***********************************************************************************************************
#include "CTexture_2D_Base.h"

//***********************************************************************************************************
// クラス定義
//***********************************************************************************************************
class GameMain_MusicDataFrame : public CTexture_2D_Base
{
private:
	int nFrameCount;
	int nAddAlpha;

public:
	void Update();						// 更新
	void Draw();						// 描画

	GameMain_MusicDataFrame();			// コンストラクタ
	virtual ~GameMain_MusicDataFrame();	// デストラクタ
};