//*************************************************************************
//
// ここにオブジェクトの説明
//
//*************************************************************************
#pragma once 

//*************************************************************************
// インクルード部
//*************************************************************************
#include "CDirectX.h"

//*************************************************************************
// クラス定義
//*************************************************************************
class Result_BCWGauge
{
private:
	int					nObject_Num;	// オブジェクト数

	LPDIRECT3DTEXTURE9*	pTexture;		// テクスチャデータへのポインタ
	VERTEX_2D*			aVertex;		// 頂点情報格納

	int nMax_ButtonNort;	// ボタンノーツ総数
	int nMax_ClickNort;		// クリックノーツ総数
	int nMax_WheelNort;		// ホイールノーツ総数

	int nButtonGauge;		// ボタンノーツ成功割合(％)
	int nClickGauge;		// クリックノーツ成功割合(％)
	int nWheelGauge;		// ホイールノーツ成功割合(％)

public:
	void Update(void);
	void Draw(void);

	Result_BCWGauge(void);
	virtual ~Result_BCWGauge(void);
};

//*************************************************************************
// EOF
//*************************************************************************
