//**********************************************************
//
// 3D画像描画テンプレート
//
//**********************************************************
#pragma once

//******************************************
// インクルード部
//******************************************
#include "CTexture_3D_Base.h"

//******************************************
// クラス定義
//******************************************
class Texture_3D_Template : public CTexture_3D_Base
{
private:

public:
	void Update();					// 更新
	void Draw();					// 描画

	Texture_3D_Template();			// コンストラクタ
	virtual ~Texture_3D_Template();	// デストラクタ
};