//***********************************************************************************************************
//
// タイトルシーン一括管理
//
//***********************************************************************************************************

//***********************************************************************************************************
// インクルード部
//***********************************************************************************************************
#include "Title_Scene.h"
#include "CInput.h"

//***********************************************************************************************************
// コンストラクタ
//***********************************************************************************************************
Title_Scene::Title_Scene(ISceneChanger* changer) : CBaseScene(changer)
{
	// ここでオブジェクトのnew処理
	Back	= new Title_Back;
	Bill	= new Title_Bill;
	Model	= new Model_Template;
	TitleBGM = new CSound;
	TitleBGM->Init("../DATA/BGM/Main.wav");
	TitleBGM->Play(true);
	cnt = 0;
}

//***********************************************************************************************************
// デストラクタ
//***********************************************************************************************************
Title_Scene::~Title_Scene(void)
{
	// ここでオブジェクトのdelete処理
	delete Back;
	delete Bill;
	delete Model;
	delete TitleBGM;
}

void Title_Scene::Initialize()
{

}

void Title_Scene::Finalize()
{

}

//***********************************************************************************************************
// 更新
//***********************************************************************************************************
void Title_Scene::Update(void)
{
	// ここでオブジェクトのupdate処理
	Back->Update();
	Bill->Update();
	Model->Update();

	cnt++;
	if (cnt % 60 == 0)
	{
		cnt = 0;
	}
	if (CInput::GetKeyboardData(DIK_RETURN, TRIGGER))
	{
		mSceneChanger->ChangeScene(eScene_ModeSelect);
	}
}

//***********************************************************************************************************
// 描画
//***********************************************************************************************************
void Title_Scene::Draw(void)
{
	// 描画順は上の行から順に(但し2Dベース画像はこの限りではありません)
	Back->Draw();
	Bill->Draw();	// Texture_3D_Base	から派生
	//Model->Draw();
}